esp8266/Arduino/cores/esp8266/uart.cpp
    ETS_UART_INTR_DISABLE();
    int uartrxbufferavailable = uart_rx_buffer_available_unsafe(uart->rx_buffer);
    ETS_UART_INTR_ENABLE();

    return uartrxbufferavailable + uart_rx_fifo_available(uart->uart_nr);
}

int
uart_peek_char(uart_t* uart)
{
    if(uart == NULL || !uart->rx_enabled)
        return -1;

    ETS_UART_INTR_DISABLE(); //access to rx_buffer can be interrupted by the isr (similar to a critical section), so disable interrupts here
    int ret = uart_peek_char_unsafe(uart);
    ETS_UART_INTR_ENABLE();
    return ret;
}

int
uart_read_char(uart_t* uart)
{
    uint8_t ret;
    return uart_read(uart, (char*)&ret, 1)? ret: -1;
}

// loopback-test BW jumps by 190%
size_t
uart_read(uart_t* uart, char* userbuffer, size_t usersize)
{
    if(uart == NULL || !uart->rx_enabled)
        return 0;

    size_t ret = 0;
    ETS_UART_INTR_DISABLE();

    while (ret < usersize && uart_rx_available_unsafe(uart))
    {
        if (!uart_rx_buffer_available_unsafe(uart->rx_buffer))
        {
            // no more data in sw buffer, take them from hw fifo
            while (ret < usersize && uart_rx_fifo_available(uart->uart_nr))
                userbuffer[ret++] = USF(uart->uart_nr);

	    // no more sw/hw data available
            break;
        }

        // pour sw buffer to user's buffer
        // get largest linear length from sw buffer
        size_t chunk = uart->rx_buffer->rpos < uart->rx_buffer->wpos?
                           uart->rx_buffer->wpos - uart->rx_buffer->rpos:
                           uart->rx_buffer->size - uart->rx_buffer->rpos;
        if (ret + chunk > usersize)
            chunk = usersize - ret;
        memcpy(userbuffer + ret, uart->rx_buffer->buffer + uart->rx_buffer->rpos, chunk);
        uart->rx_buffer->rpos = (uart->rx_buffer->rpos + chunk) % uart->rx_buffer->size;
        ret += chunk;
    }

    ETS_UART_INTR_ENABLE();
    return ret;
}

// When GDB is running, this is called one byte at a time to stuff the user FIFO
// instead of the uart_isr...uart_rx_copy_fifo_to_buffer_unsafe()
// Since we've already read the bytes from the FIFO, can't use that
// function directly and need to implement it bytewise here
static void ICACHE_RAM_ATTR uart_isr_handle_data(void* arg, uint8_t data)
{
    uart_t* uart = (uart_t*)arg;
    if(uart == NULL || !uart->rx_enabled) {
        return;
    }

// Copy all the rx fifo bytes that fit into the rx buffer
// called by ISR
    struct uart_rx_buffer_ *rx_buffer = uart->rx_buffer;

    size_t nextPos = (rx_buffer->wpos + 1) % rx_buffer->size;
    if(nextPos == rx_buffer->rpos)
    {
        uart->rx_overrun = true;
        //os_printf_plus(overrun_str);

        // a choice has to be made here,
        // do we discard newest or oldest data?
#ifdef UART_DISCARD_NEWEST
        // discard newest data
        // Stop copying if rx buffer is full
        return;
#else
        // discard oldest data
        if (++rx_buffer->rpos == rx_buffer->size)
            rx_buffer->rpos = 0;
#endif
    }
    rx_buffer->buffer[rx_buffer->wpos] = data;
    rx_buffer->wpos = nextPos;

    // Check the UART flags and note hardware overflow/etc.
    uint32_t usis = USIS(uart->uart_nr);

    if(usis & (1 << UIOF))
        uart->rx_overrun = true;

    if (usis & ((1 << UIFR) | (1 << UIPE) | (1 << UITO)))
        uart->rx_error = true;

    USIC(uart->uart_nr) = usis;
}

size_t
uart_resize_rx_buffer(uart_t* uart, size_t new_size)
{
    if(uart == NULL || !uart->rx_enabled)
        return 0;

    if(uart->rx_buffer->size == new_size)
        return uart->rx_buffer->size;

    uint8_t * new_buf = (uint8_t*)malloc(new_size);
    if(!new_buf)
        return uart->rx_buffer->size;

    size_t new_wpos = 0;
    ETS_UART_INTR_DISABLE();
    while(uart_rx_available_unsafe(uart) && new_wpos < new_size)
        new_buf[new_wpos++] = uart_read_char_unsafe(uart); //if uart_rx_available_unsafe() returns non-0, uart_read_char_unsafe() can't return -1
    if (new_wpos == new_size)
        new_wpos = 0;

    uint8_t * old_buf = uart->rx_buffer->buffer;
    uart->rx_buffer->rpos = 0;
    uart->rx_buffer->wpos = new_wpos;
    uart->rx_buffer->size = new_size;
    uart->rx_buffer->buffer = new_buf;
    ETS_UART_INTR_ENABLE();
    free(old_buf);
    return uart->rx_buffer->size;
}

size_t
uart_get_rx_buffer_size(uart_t* uart)
{
    return uart && uart->rx_enabled? uart->rx_buffer->size: 0;
}

// The default ISR handler called when GDB is not enabled
void ICACHE_RAM_ATTR
uart_isr(void * arg)
{
    uart_t* uart = (uart_t*)arg;
    uint32_t usis = USIS(uart->uart_nr);

    if(uart == NULL || !uart->rx_enabled)
    {
        USIC(uart->uart_nr) = usis;
        ETS_UART_INTR_DISABLE();
        return;
    }

    if(usis & (1 << UIFF))
        uart_rx_copy_fifo_to_buffer_unsafe(uart);

    if(usis & (1 << UIOF))
    {
        uart->rx_overrun = true;
        //os_printf_plus(overrun_str);
    }

    if (usis & ((1 << UIFR) | (1 << UIPE) | (1 << UITO)))
        uart->rx_error = true;

    USIC(uart->uart_nr) = usis;
}

static void
uart_start_isr(uart_t* uart)
{
    if(uart == NULL || !uart->rx_enabled)
        return;

    if(gdbstub_has_uart_isr_control()) {
        gdbstub_set_uart_isr_callback(uart_isr_handle_data,  (void *)uart);
        return;
    }

    // UCFFT value is when the RX fifo full interrupt triggers.  A value of 1
    // triggers the IRS very often.  A value of 127 would not leave much time
    // for ISR to clear fifo before the next byte is dropped.  So pick a value
    // in the middle.
    // update: loopback test @ 3Mbauds/8n1 (=2343Kibits/s):
    // - 4..120 give > 2300Kibits/s
    // - 1, 2, 3 are below
    // was 100, use 16 to stay away from overrun
    #define INTRIGG 16

    //was:USC1(uart->uart_nr) = (INTRIGG << UCFFT) | (0x02 << UCTOT) | (1 <<UCTOE);
    USC1(uart->uart_nr) = (INTRIGG << UCFFT);
    USIC(uart->uart_nr) = 0xffff;
    //was: USIE(uart->uart_nr) = (1 << UIFF) | (1 << UIFR) | (1 << UITO);
    // UIFF: rx fifo full
    // UIOF: rx fifo overflow (=overrun)
    // UIFR: frame error
    // UIPE: parity error
    // UITO: rx fifo timeout
    USIE(uart->uart_nr) = (1 << UIFF) | (1 << UIOF) | (1 << UIFR) | (1 << UIPE) | (1 << UITO);
    ETS_UART_INTR_ATTACH(uart_isr,  (void *)uart);
    ETS_UART_INTR_ENABLE();
}

static void
uart_stop_isr(uart_t* uart)
{
    if(uart == NULL || !uart->rx_enabled)
        return;

