esp8266/Arduino/cores/esp8266/uart.cpp
    if(uart->uart_nr == UART0) // Only UART0 allows pin changes
    {
        if(uart->tx_enabled && uart->tx_pin != tx)
        {
            if( rx == 13 && tx == 15)
            {
                uart_swap(uart, 15);
            }
            else if (rx == 3 && (tx == 1 || tx == 2))
            {
                if (uart->rx_pin != rx)
                    uart_swap(uart, tx);
                else
                    uart_set_tx(uart, tx);
            }
        }
        if(uart->rx_enabled && uart->rx_pin != rx && rx == 13 && tx == 15)
            uart_swap(uart, 15);
    }
}


bool
uart_tx_enabled(uart_t* uart)
{
    if(uart == NULL)
        return false;

    return uart->tx_enabled;
}

bool
uart_rx_enabled(uart_t* uart)
{
    if(uart == NULL)
        return false;

    return uart->rx_enabled;
}

bool
uart_has_overrun (uart_t* uart)
{
    if (uart == NULL || !uart->rx_overrun)
        return false;

    // clear flag
    uart->rx_overrun = false;
    return true;
}

bool
uart_has_rx_error (uart_t* uart)
{
    if (uart == NULL || !uart->rx_error)
        return false;

    // clear flag
    uart->rx_error = false;
    return true;
}

static void
uart_ignore_char(char c)
{
    (void) c;
}

inline void
uart_write_char_delay(const int uart_nr, char c)
{
    while(uart_tx_fifo_full(uart_nr))
        delay(0);

    USF(uart_nr) = c;

}

static void
uart0_write_char(char c)
{
    uart_write_char_delay(0, c);
}

static void
uart1_write_char(char c)
{
    uart_write_char_delay(1, c);
}

void
uart_set_debug(int uart_nr)
{
    s_uart_debug_nr = uart_nr;
    fp_putc_t func = NULL;
    switch(s_uart_debug_nr) 
    {
    case UART0:
        func = &uart0_write_char;
        // This selects the UART for ROM ets_putc which is used by
        // ::printf, ets_printf_P in core_esp_postmortem.cpp and others.
        // Has a side effect of clearing RX FIFO for UART0
        uart_buff_switch(0);
        break;
    case UART1:
        func = &uart1_write_char;
        uart_buff_switch(1);
        break;
    case UART_NO:
    default:
        func = &uart_ignore_char;
        // There is no disable option for ets_putc,
        // we switch to UART0 for disable case.
        uart_buff_switch(0);
        break;
    }
    if(gdbstub_has_putc1_control()) {
        gdbstub_set_putc1_callback(func);
    } else {
        if (uart_nr == UART0 || uart_nr == UART1) {
            system_set_os_print(1);
        } else {
            system_set_os_print(0);
        }
        ets_install_putc1(func);
    }
}

int
uart_get_debug()
{
    return s_uart_debug_nr;
}

/*
To start detection of baud rate with the UART the UART_AUTOBAUD_EN bit needs to be cleared and set. The ROM function uart_baudrate_detect() does this only once, so on a next call the UartDev.rcv_state is not equal to BAUD_RATE_DET. Instead of poking around in the UartDev struct with unknown effect, the UART_AUTOBAUD_EN bit is directly triggered by the function uart_detect_baudrate().
*/
void
uart_start_detect_baudrate(int uart_nr)
{
    USA(uart_nr) &= ~(UART_GLITCH_FILT << UART_GLITCH_FILT_S | UART_AUTOBAUD_EN);
    USA(uart_nr) = 0x08 << UART_GLITCH_FILT_S | UART_AUTOBAUD_EN;
}

int
uart_detect_baudrate(int uart_nr)
{
    static bool doTrigger = true;

    if (doTrigger)
    {
        uart_start_detect_baudrate(uart_nr);
        doTrigger = false;
    }

    int32_t divisor = uart_baudrate_detect(uart_nr, 1);
    if (!divisor) {
        return 0;
    }

    doTrigger = true;    // Initialize for a next round
    int32_t baudrate = UART_CLK_FREQ / divisor;

    static const int default_rates[] = {300, 600, 1200, 2400, 4800, 9600, 19200, 38400, 57600, 74880, 115200, 230400, 256000, 460800, 921600, 1843200, 3686400};

    size_t i;
    for (i = 1; i < sizeof(default_rates) / sizeof(default_rates[0]) - 1; i++)	// find the nearest real baudrate
    {
        if (baudrate <= default_rates[i])
        {
            if (baudrate - default_rates[i - 1] < default_rates[i] - baudrate) {
                i--;
            }
            break;
        }
    }

    return default_rates[i];
}

};
